Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/children_and_young_offenders/children_and_the_criminal_justice_system_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Children and the criminal justice system
ga: Leanaí agus an córas ceartais choiriúil

source: Children are among the most vulnerable members of society
ga: Tá leanaí in Éirinn ar na daoine is soghonta sa tsochaí

source: The law of the state protects children until they are deemed to be able to interact in society as adults
ga: Cosnaíonn dlí an stáit leanaí go dtí go meastar go bhfuil siad in ann idirghníomhú leis an tsochaí mar dhaoine fásta

source: For this reason children are treated differently from adults by the criminal justice system
ga: Mar gheall air sin, ní dhéileálann an córas ceartais choiriúil in Éirinn le leanaí ar an mbealach céanna ar a ndéileálann sé le daoine fásta

source: The law which deals with children found in breach of the criminal law is contained in the Children Act, 2001 which was amended by the Criminal Justice Act 2006, the Children (Amendment) Act 2015 and other acts
ga: Tá an dlí a dhéileálann le leanaí a sháraíonn dlí coiriúil le fáil in Acht na Leanaí, 2001 arna leasú ag an Acht um Cheartas Coiriúil 2006

source: The Children Act 2001 Act became law in July 2001 and since then most of the provisions of the 2001 Act and the amendments have been brought into force
ga: Tháinig Acht na Leanaí 2001 i bhfeidhm sa dlí i mí Iúil 2001 agus ó shin cuireadh formhór na bhforálacha ó Acht 2001 agus na leasuithe i bhfeidhm

source: The 2001 legislation is based on the philosophy that children in conflict with the law should only be detained (custody) by the state as a last resort
ga: Tá reachtaíocht 2001 bunaithe ar fhealsúnacht nár chóir don stát leanaí i gcoinbhleacht leis an dlí a choinneáil (caomhnadh) ach mar rogha deiridh

source: There are many community based measures which must be explored and exhausted before detention can be considered
ga: Tá a lán beart pobalbhunaithe ar chóir féachaint orthu agus leas a bhaint astu sular féidir smaoineamh faoi leanbh a choinneáil

source: There were three Departments of the Government with the responsibility for overseeing the implementation of the Children Act, 2001
ga: Bhí trí Roinn Rialtais le freagracht as maoirseacht a dhéanamh ar chur i bhfeidhm Acht na Leanaí, 2001

source: • Department of Justice and Equality
ga: • An Roinn Dlí agus Cirt agus Comhionannais

source: • Department of Education and Skills
ga: • An Roinn Oideachais agus Scileanna

source: The Office of the Minister for Children and Youth Affairs was set up in December 2005 to bring greater coherence to policy-making for children
ga: Bunaíodh Oifig an Aire Leanaí agus Gnóthaí Óige i mí na Nollag 2005 chun comhleanúnachas níos mó a chothú maidir le beartais a dhéanamh do leanaí

source: While it was part of the Department of Health it also included units from the two other departments, such as the Irish Youth Justice Service
ga: Cé go raibh sé mar chuid den Roinn Sláinte áiríodh sé freisin aonaid ón dá roinn eile cosúil le Seirbhís Ceartais Óige na hÉireann

source: The Irish Youth Justice Service was established in December 2005 within the Department of Justice and Equality
ga: Bunaíodh Seirbhís Ceartais Óige na hÉireann i mí na Nollag 2005 laistigh den Roinn Dlí agus Cirt agus Comhionannais

source: The Service brought together all of the State's youth justice services in one place
ga: Cur an tSeirbhís seirbhísí ceartais óige uile an Stáit ar fáil le chéile in áit amháin

source: It provided strategic direction to the development of services and promote necessary reforms
ga: Thug sé treoir straitéiseach d'fhorbairt seirbhísí agus cothóidh sé leasuithe riachtanacha

source: In June 2011, the Department of Children and Youth Affairs was established
ga: I mí an Mheithimh 2011, bunaíodh an Roinn Leanaí agus Gnóthaí Óige

source: It took over the functions of the Office of the Minister for Children and Youth Affairs
ga: Thóg sé breis agus feidhmeanna na Oifig an Aire Leanaí agus Gnóthaí Óige

source: Certain units from other departments also became part of the new Department, such as the Irish Youth Justice Service
ga: Bhí aonaid áirithe ó Ranna eile mar chuid na Roinne nua cosúil le Seirbhís Ceartais Óige na hÉireann

source: Definition of a child in criminal law
ga: Sainmhíniú ar leanbh sa dlí coiriúil

source: Until the introduction of the Children Act 2001 many expressions were used to identify someone within the scope of the juvenile justice system
ga: Go dtí gur tugadh Acht na Leanaí 2001 isteach, baineadh úsáid as a lán nathanna éagsúla chun daoine a aithint a bhí laistigh de scóip an chórais cheartais ógánach

source: Expressions such as minor, juvenile, youth offender and young person were commonplace
ga: Baineadh úsáid fhorleathan as nathanna cosúil le mionúr, ógánach, ciontóir óg agus duine óg

source: However, the word child is now defined by Section 3 of the 2001 Act to mean a person under the age of 18 years
ga: Anois, áfach, sainmhíníonn Alt 3 d'Acht 2001 an focal leanbh mar dhuine faoi bhun 18 mbliana d'aois

source: The Children Act 2001 does not distinguish between a child and a young person
ga: Ní dhéanann Acht na Leanaí 2001 idirdhealú idir leanbh agus duine óg

source: Any provisions in earlier Acts distinguishing different classes of children (for example, young persons, minors, child) no longer exist
ga: Níl aon fhorálacha in Achtanna níos luaithe a dhéanann idirdhealú idir ranganna éagsúla leanaí (mar shampla, daoine óga, mionúir, leanbh) ann níos mó

source: Age of criminal responsibility
ga: Aois na freagrachta coiriúla

source: The age of criminal responsibility is covered by Section 52 of the Children Act 2001 as amended by Section 129 of the Criminal Justice Act 2006
ga: Clúdaíonn Alt 52 d'Acht na Leanaí 2001 arna leasú ag Alt 129 den Acht um Cheartas Coiriúil 2006 aois na freagrachta coiriúla

source: This came into effect in October 2006, raising the age of criminal responsibility from 7 years of age to 12 years of age
ga: Tháinig sé sin i bhfeidhm i mí Dheireadh Fómhair 2006, agus d'ardaigh sé aois na freagrachta coiriúla ó 7 mbliana d'aois go dtí 12 bhliain d'aois

source: This means that children who have not reached the age of 12 years cannot be charged with an offence
ga: Ciallaíonn sé sin nach féidir cion a chur i leith leanaí faoi bhun aois 12 bhliain

source: There is an exception, however, for children aged 10 or 11 who can be charged with murder, manslaughter, rape or aggravated sexual assault
ga: Tá eisceacht ann, áfach, do leanaí ag aois 10 nó 11, mar is féidir iad a chúiseamh i ndúnmharú, dúnorgain, éigniú nó tromionsaí gnéasach

source: In addition, where a child under 14 years of age is charged with an offence, no further proceedings can be taken without the consent of the Director of Public Prosecutions
ga: Chomh maith leis sin, nuair a chúisítear leanbh faoi bhun 14 bliana d'aois i gcion, ní féidir aon imeachtaí breise a dhéanamh gan toiliú an Stiúrthóra Ionchúiseamh Poiblí

source: Although the 2001 Act in general prohibits children under 12 years of age from being charged and convicted of a criminal offence, they do not enjoy total immunity from action being taken against them
ga: Cé go gcuireann Acht 2001 cosc ginearálta ar leanaí faoi bhun 12 bhliain d'aois a chúiseamh agus a chiontú i gcion coiriúil, níl díolúine iomlán ag na leanaí sin ó ghníomhartha a bheith déanta ina gcoinne

source: Section 53 of the Act as amended by Section 130 of the Criminal Justice Act 2006 places an onus on the Gardai to take a child under 12 years of age to his/her parents or guardian, where they have reasonable grounds for believing that the child has committed an offence with which the child cannot be charged due to the child’s age
ga: Leagann Alt 53 den Acht arna leasú ag Alt 130 den Acht um Cheartas Coiriúil 2006 dualgas ar na Gardaí leanbh faoi bhun 12 bhliain d'aois a thabhairt chuig a t(h)uismitheoirí nó a c(h)aomhnóir má tá cúis réasúnach ag na Gardaí a chreideamh go bhfuil an leanbh ciontach i gcion nach féidir an leanbh a chiontú as mar gheall ar aois an linbh

source: Where this is not possible the Gardai will arrange for the child to be taken into the custody of the Child and Family Agency (Tusla) for the area in which the child normally resides
ga: Nuair nach bhfuil sé sin indéanta, eagróidh na Gardaí go gcuirfear an leanbh faoi choimeád An Ghníomhaireacht um Leanaí agus an Teaghlach (Tusla) don cheantar ina bhfuil gnáthchónaí ar an leanbh

source: It is possible that children under 12 years of age who commit criminal offences will be dealt with by Tusla and not the criminal justice system
ga: Is féidir le Tusla déileáil le leanaí faoi bhun 12 bhliain d'aois a dhéanann cionta coiriúla in ionad an chórais cheartais choiriúil

source: Under Section 142 of the Children Act 2001, a court may impose a period of detention on a child
ga: Faoi Alt 142 d'Acht na Leanaí 2001, féadann cúirt tréimhse coinneála a chur i bhfeidhm ar leanbh

source: Children between the ages of 10 and 16 sentenced by the courts to a period of detention are sent to the Oberstown Children Detention Campus
ga: Nuair atá an leanbh faoi bhun 16 bliana d'aois, coinnítear an leanbh i scoil coinneála leanaí

source: 17-year-olds sentenced after 31 March 2017 are also sent to the Oberstown Children Detention Campus
ga: Coinnítear leanaí 16 bliana agus 17 mbliana d'aois in ionaid choinneála leanaí

source: You can find out more in our document on the detention of children
ga: Tá níos mó faisnéise faoi choinneáil leanaí agus daoine óga anseo

source: Under Section 258 of the Children Act 2001 an offence committed by a child under the age of 18, for which they have been found guilty, can be automatically expunged from the record as if never committed, once certain conditions are met
ga: Faoi Alt 258 d’Acht na Leanaí, 2001, féadtar cion a dhéanann leanbh faoi aois 18, ar deimhníodh go raibh siad ciontach ina leith, a dhíscríobh go huathoibríoch ón taifead amhail nár tharla sé, a luaithe a chomhlíontar roinnt coinníollacha

source: The conditions are as follows:
ga: Is iad seo a leanas na coinníollacha:

source: • The offence was committed before the child reached the age of 18 years
ga: • Rinneadh an cion sular bhain an leanbh aois 18 mbliana amach

source: • The offence is not one required to be tried by the Central Criminal Court (such as murder or rape)
ga: • Ní cion atá sa chion ar gá don Phríomh-Chúirt Choiriúil é a thriail (ar nós cion dúnmharaithe nó éignithe)

source: • At least 3 years have elapsed since the finding of guilt and
ga: • Tá ar a laghad 3 bliana caite ó deimhníodh an chiontacht agus

source: • The child has not been dealt with for another offence in that 3-year period
ga: • Níor déileáladh leis an leanbh mar gheall ar chion eile sa tréimhse 3 bliana sin

source: If these conditions are met, they are no longer regarded under Irish law as having committed an offence
ga: Má chomhlíontar na coinníollacha seo, ní chaitear leo, faoi dhlí na hÉireann, amhail go ndearna siad cion

source: If they have received a caution or have been dealt with under the Probation of Offenders Act 1907, Section 258 also applies
ga: Má tugadh rabhadh dóibh nó má déileáladh leo faoin Acht um Promhadh Ciontóirí, 1907, beidh feidhm ag Alt 258 chomh maith

source: When looking for employment or applying for an educational course or insurance, they can claim to have a clean record
ga: Nuair a bhíonn fostaíocht á cuardach nó nuair a bhíonn iarratas á dhéanamh ar chúrsa oideachais nó ar árachas, féadfaidh siad a mhaíomh go bhfuil taifead gan locht acu

source: However, if they are travelling or emigrating to a country such as the USA or Australia, they are subject to that country’s immigration laws and may have to disclose such convictions
ga: Má bhíonn siad ag taisteal nó ag dul ar imirce chuig tír ar nós SAM nó na hAstráile, áfach, beidh siad faoi réir dhlíthe inimirce na tíre sin agus d’fhéadfadh go mbeadh orthu na ciontuithe siúd a nochtadh
